nxp-mcuxpresso/mcux-soc-svd/MCXN947/MCXN947_cm33_core0.xml
          <register>
            <name>EVTG_CTRL</name>
            <description>Control and Status</description>
            <addressOffset>0xA</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>FF_INIT</name>
                <description>Flip flop Initial Value Configuration</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FF0</name>
                    <description>0</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FF1</name>
                    <description>1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INIT_EN</name>
                <description>Flip-Flop Initial Output Enable Control</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PULSE</name>
                    <description>Write 0 does not generate enable pulse</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NO_PULSE</name>
                    <description>Write 1 generates enable pulse</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MODE_SEL</name>
                <description>Flip-Flop Mode Selection</description>
                <bitOffset>2</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Bypass</name>
                    <description>Bypass mode</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RS</name>
                    <description>RS Trigger mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TFF</name>
                    <description>T-FF mode</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DFF</name>
                    <description>D-FF mode</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>JKFF</name>
                    <description>JK-FF mode</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LATCH</name>
                    <description>Latch mode</description>
                    <value>0x5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FB_OVRD</name>
                <description>EVTG Output Feedback Override Control</description>
                <bitOffset>6</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>An</name>
                    <description>Replace An</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Bn</name>
                    <description>Replace Bn</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Cn</name>
                    <description>Replace Cn</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Dn</name>
                    <description>Replace Dn</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SYNC_CTRL</name>
                <description>Synchronize Control</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>D_NOTSYNC</name>
                    <description>EVTG input &quot;Dn&quot; will not be synced</description>
                    <value>#0xxx</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>C_NOTSYNC</name>
                    <description>EVTG input &quot;Cn&quot; will not be synced</description>
                    <value>#x0xx</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_NOTSYNC</name>
                    <description>EVTG input &quot;Bn&quot; will not be synced</description>
                    <value>#xx0x</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>A_NOTSYNC</name>
                    <description>EVTG input &quot;An&quot; will not be synced</description>
                    <value>#xxx0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>A_SYNC</name>
                    <description>EVTG input &quot;An&quot; will be synced by two bus clk cycles</description>
                    <value>#xxx1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_SYNC</name>
                    <description>EVTG input &quot;Bn&quot; will be synced by two bus clk cycles</description>
                    <value>#xx1x</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>C_SYNC</name>
                    <description>EVTG input &quot;Cn&quot; will be synced by two bus clk cycles</description>
                    <value>#x1xx</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>D_SYNC</name>
                    <description>EVTG input &quot;Dn&quot; will be synced by two bus clk cycles</description>
                    <value>#1xxx</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FORCE_BYPASS</name>
                <description>Force Bypass Control</description>
                <bitOffset>12</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NFB1</name>
                    <description>Will not force the bypass</description>
                    <value>#0x</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NFB0</name>
                    <description>Will not force the bypass</description>
                    <value>#x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>F_FF_A</name>
                    <description>Whatever MODE_SEL is, will force bypass flip-flop and route the AOI_0(Filter_0) value directly to EVTG_OUTA</description>
                    <value>#x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>F_FF_B</name>
                    <description>Whatever MODE_SEL is, will force bypass flip-flop and route the AOI_1(Filter_1) value directly to EVTG_OUTB</description>
                    <value>#1x</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>EVTG_AOI0_FILT</name>
            <description>AOI0 Output Filter</description>
            <addressOffset>0xC</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>FILT_PER</name>
                <description>Output Filter Sample Period</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FILT_CNT</name>
                <description>Output Filter Sample Count</description>
                <bitOffset>8</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>EVTG_AOI1_FILT</name>
            <description>AOI1 Output Filter</description>
            <addressOffset>0xE</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>FILT_PER</name>
                <description>Output Filter Sample Period</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FILT_CNT</name>
                <description>Output Filter Sample Count</description>
                <bitOffset>8</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
